//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Console.WriteLine("Введите 1ое число");
int a = int.Parse(Console.ReadLine()) ;
Console.WriteLine("Введите 2ое число");
int b = int.Parse(Console.ReadLine()) ;
Console.WriteLine("Введите 3ое число");
int с = int.Parse(Console.ReadLine()) ;
int max = -100000;
if (max>max)
{
    max=a;
}
if (b>max)
{
    max=b;
}
if ( с  >max)
{
    max=с ;
}
Console.WriteLine($"max = {max}");
